OpenFoam/Steady_laminar_flow_duct/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0.05 0 0);
    }

    inlet2
    {
        type            fixedValue;
	value		uniform (0 0.05 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    duct1
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }

    duct2
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }

    symmetry
    {
	type		symmetryPlane;
    }
}

// ************************************************************************* //
